{
    "author": "Anonymous Mouse",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 848,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/848",
    "title": "Iclicker marks adjustment?",
    "question": "Any chance the grading scheme for clicker marks can be slightly adjusted? \ne.g. if the average of mt2 + final is higher than our participation mark, it replaces our participation mark\nedit: OR e.g. Clicker mark of every lecture is out of one less (only those who participated in class gets one free mark, with max of 100%) + drop two lowest lectures (for people who have covid etc.)\nI've done very well on both midterms, but my participation score is <70 while attending every single lecture (except one). I'm getting one or two clickers wrong quite often, and some of the questions are somewhat challenging (<50% class getting the question correct).\nI understand the course's motivation in making these clicker be marked for correctness, and making sure students know that participation cannot be made up later (or at least not telling us about a possibility of a grading scheme change? one can hope).\nI would assume the hope is for students to learn and do well on the exams, which I have been able to do (so far). Perhaps it over penalizes students who are slower at learning (me).\nIt just sucks to lose more than double the % I lost on both midterms combined, just on participation. \nMaybe an instructor can chime in? (Or perhaps these adjustments are considered after we've written our finals) \nApologies for the nature of this post. Thanks for your time.",
    "student_answer": "I don't think this would be a fair exception if offered to one student. If that was the case then students would just not come to class and do well on midterms, which I think is the opposite of what the profs want.",
    "instructor_answer": "The grading scheme we have is designed to balance a number of different goals.  \nThe clicker mark in particular is designed to encourage and reward being well-prepared for lecture.  We do this because the lecture design is such that students really do need to be well-prepared with the prior material.  We know that takes a lot of work, and so the clicker questions and weight assigned to them is designed to support that amount of work.\nBut because it takes a lot of pre-work, and because some of the questions require a good understanding of that work, the average for clicker questions is lower than labs and problem sets (which have very high average grades).\nWe published the grading scheme on the first day of the course because we feel all students want to know it, and potentially plan with it in mind.  I don't believe it would be fair to change that grading scheme at this point."
}