{
    "author": "Emily Fuchs (she/they)",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 817,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/817",
    "title": "Midterm 2 Grades and Information",
    "question": "SOME OF THE INFORMATION IN THIS POST IS VERY TIMELY. ALL OF IT IS VERY IMPORTANT. WE KNOW IT IS LONG, BUT PLEASE READ IT ALL NOW.\nPlease respect the time of everyone on Piazza and read this entire message carefully before posting anything about the midterm. Questions that could be answered by reading this post will not be answered.\n  There are several sections below including:\nStatistics\nFeedback on individual problems\nWhat getting a low grade means\nNotes about the rubric\nViewing your exam in Gradescope\nSubmitting regrade requests\n\nStatistics\nThe individual problem weights and stats are as follows:\n  Problem\n1\n2\n3\n4\n5\n5ta\nTotal\nWeight\n.15\n.25\n.20\n.15\n.20\n.05\n1\nMedian\n100\n52\n59\n40\n100\n40\n-\nMean\n89\n55\n62\n47\n82\n40\n65\n\n\n  Feedback on Individual Problems\nThis was almost entirely autograded.  Problems 1-4 were entirely autograded - when you go look at your exam in Gradescope you should ignore the gradescope score and read only the grading report.\n  Problem 5 was graded twice and appears in Gradescope twice.  “MT2 - P5” is the autograding of almost all the problem. For this part you should ignore the gradescope score and focus on the autograder report.  “MT2 - P5ta” is the hand grading of the termination argument. For this part you should ignore the autograding report and focus only on the Gradescope rubric.   \n  Problem 1\nThis problem was not particularly challenging, but it is important to be able to understand the different kinds of reference relation.  During the exam a number of students were using this picture to plan their solutions to both problem 2 and 3 which can be quite useful.\n  Problem 2\nThis problem was very important.  We would have liked to see the class do better on this material. As we go forward in the course we will be doing problems just like this quite often.  It required you to use the entire HtDF recipe. For the function definition stage you had to be able to take a set of template functions in mutual recursion, and understand how to complete them to get the function you wanted.  A crucial step here was reasoning about the function design at the @template stage, and realizing there were two places where you would have to decide what to do based on whether a mutual recursion had succeeded or failed – which would require 2 try-catch.\n  If you had difficulty with this problem please review it carefully, take it to office hours for help, and/or review module 6.\n  Problem 3\nThis problem is also quite important, although somewhat less so than problem 2. But recursion and mutual recursion with fold functions is a powerful tool, and if you had difficulty with this problem definitely review module 8.\n  Problem 4\nThis material is important. Going forward we will make frequent use of built in abstract functions.  But this particular problem was perhaps more difficult than we intended, so we reduced the weight accordingly. If you had difficulty with this problem definitely review module 8.\n  Problem 5\nWe were very happy to see how well the class did with this problem.  Over the next three weeks we will be building up to generative recursions through graphs. The functions we write will often look like the one in problem 2, with the addition of the genrec template. So this material in problem 5 is quite important.  If you had difficulty with this problem review module 9a.\n  What Getting a Low Grade Means\nIn an ideal scenario, your score on MT2 would be an accurate reflection of your understanding. We suggest you interpret grades below 60 as follows:\n50 – 60\nWe suggest you read through the comments we present on each question and work through the problems again on your own without looking at the solution files (if possible). Also, we suggest that you reflect on how you budget your time during the exam and how you can use time more effectively on the final.\n35 – 50 \nIf you are in this band, we encourage you to do the following:\nAttend TA or instructor office hours in the next few days. At those office hours, ask the course staff to review your exam and your work to date. They will help you develop a plan for the remainder of the term. \nGoing forward from that point try to dedicate at least an hour each day to work through exercises. \nIn addition, plan to attend 110 office hours at least 2 times a week - use the time to work through practice problems, and whenever you get stuck ask us to give you a hint to get you unstuck\nYou have some significant work to do to get back on top of the material, and working with us in office hours will be a key tool for doing that.\nFor grades below 35\nA great deal of work will be required in the next 3 weeks to succeed in CPSC 110. We strongly recommend that you attend instructor office hours to discuss the next steps.\nSee below about regrade requests - DO NOT contact us via email or Piazza about regrade requests.\nNotes About the Rubric\nFirst, note that the rubric we have in Gradescope USES NEGATIVE SCORING. If you have an item checked, this means that it was INcorrect; if you do not have an item checked, it was correct. The exam consisted of 5 different starter files, and there are 6 questions listed separately in Gradescope (MT2 - P1 through P5ta) so make sure you review each question separately. Your grade on the whole exam is the weighted sum of your grades on each of the individual problems.  The following function can help you compute your grade:\n;; Produce midterm 2 grade from per-problem scores\n(check-expect (mt2-grade 100 100 100 100 100 100) 100)\n(check-expect (mt2-grade 100   0   0   0   0   0)  15)\n(check-expect (mt2-grade   0 100   0   0   0   0)  25)\n(check-expect (mt2-grade   0   0 100   0   0   0)  20)\n(check-expect (mt2-grade   0   0   0 100   0   0)  15)\n(check-expect (mt2-grade   0   0   0   0 100   0)  20)\n(check-expect (mt2-grade   0   0   0   0   0 100)   5)\n\n(define (mt2-grade p1 p2 p3 p4 p5 p5ta)\n  (local [(define w1   .15)\n          (define w2   .25)\n          (define w3   .20)\n          (define w4   .15)\n          (define w5   .20)\n          (define w5ta .05)]\n    (+ (* w1   p1)\n      (* w2   p2)\n      (* w3   p3)\n      (* w4   p4)\n      (* w5   p5)\n      (* w5ta p5ta))))\nViewing Your Exam in Gradescope\nThe graded exams are now available in Gradescope. Please carefully read all of the steps below on how to access Gradescope using your CS ID, as the process is a little confusing.\n  The email address associated with your Gradescope account is your CSID@ugrad.cs.ubc.ca address. To find your CS ID, please login to https://www.cs.ubc.ca/getacct/ and look below your forwarding email address. You will see \"Alias: CSID@ugrad.cs.ubc.ca.\" Remember that your CS ID is a 4-5 digit ID of alternating letters and numbers. So, if your CS ID is r2d2, your email address is r2d2@ugrad.cs.ubc.ca. Make note of this email address.\nGo to http://www.gradescope.ca (note this is gradescope.CA not gradescope.COM)\nClick \"Log In\" and then \"Forgot Your Password?\"\nPlease enter the email address noted in step 1. \nThis will send an email to whatever account you have linked to your CS email forwarding. That email will include information on how to reset your password, and then you can login to Gradescope.\n\nIf you do not receive that email, make sure your email forwarding settings are set up properly. You can update your email forwarding settings here: https://www.cs.ubc.ca/getacct/. If you do not see your exam in Gradescope, please email cpsc110-admin@cs.ubc.ca.\n  Submitting Regrade Requests\nA regrade request is only appropriate if your exam was mis-graded according to the rubric. Autograded problems are by definition graded correctly, so the bar for a regrade request on an autograding problem is very high – you are arguing that the rubric itself is invalid. Keep that in mind as you consider the merits of a regrade request. We will make another Piazza post with more details about submitting a regrade request and you will be required to submit your request through Gradescope. DO NOT contact us via email or Piazza about regrade requests.",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}