{
    "author": "Anonymous Helix",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 135,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/135",
    "title": "Can I use \"0\" instead of empty-image?",
    "question": "(require spd/tags)\n(require 2htdp/image)\n;; image-area-starter.rkt\n;\n; PROBLEM:\n;\n; DESIGN a function called image-area that consumes an image and produces the\n; area of that image. For the area it is sufficient to just multiple the image’s\n; width by its height. Follow the HtDF recipe and leave behind commented\n; out versions of the stub and template.\n;\n(@htdf image-area)\n(@signature Image -> Natural)\n;; product the area of the given image\n(check-expect (image-area (rectangle 2 3 “solid” “red”)) (* 2 3))\n;\n;(define (image-area img) empty-image) ; stub\n(@template Image)\n;(define (image-area img) ;template\n; (… img))\n(define (image-area img)\n(* (image-width img) (image-height img)))\nHere are the questions\n1) Can I use \"0\" instead of empty-image?  (for stub)\nI saw on the website \"0\" for Number, \"\" for String . \nHowever, what's for the Image?   During the class, professor used empty-image instead of \"0\"  but I can actually put 0 instead? what's the difference?\n2) As for the template tag\n(@template + (?) <- supposed to be where template came from?  what does it mean ? I still dont get it. sorry I am pretty slow",
    "student_answer": "It wouldn't make sense to put \"0\" because this is a string, and it wouldn't make sense to put 0 because this is a number. You're expecting an image as the result type, so empty-image would make the most sense.\nI am not really sure what you are asking for the second question, but the Design Recipes page is a great resource! The Template and inventory section for HtDF might be helpful in answering your question.\nEDIT:\nI think the original answer might have misinterpreted your questions.\nThis problem is asking us to find the area of the given image. In this case, the result we're looking for is a Natural number, as the area of a shape cannot be negative. So, using 0 in the stub here is correct. \"empty-image\" was used during lecture for a different problem because it produced an image instead of a Natural or an Integer.\n\nThink of it this way: (@signature X -> Y)\n\nX represents the data given to the program, Y represents the data the program produces at the end.\n\nYes, the template tag represents where you got the template from. This might not make sense right now, but it'll make more sense when you get to Module 2. For now, the template tag represents that you created the template based on the data that was consumed (in this case, an image).",
    "instructor_answer": "Not Found"
}