{
    "author": "Piazza Team",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 1,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/1",
    "title": "Welcome to Piazza!",
    "question": "Piazza is a Q&A platform designed to get you great answers from classmates and instructors fast. We've put together this list of tips you might find handy as you get started:\nAsk questions!\n\nThe best way to get answers is to ask questions! Ask questions on Piazza rather than emailing your teaching staff so everyone can benefit from the response (and so you can get answers from classmates who are up as late as you are).\n\nEdit questions and answers wiki-style.\n\nThink of Piazza as a Q&A wiki for your class. Every question has just a single students' answer that students can edit collectively (and a single instructors’ answer for instructors).\n\nAdd a followup to comment or ask further questions.\n\nTo comment on or ask further questions about a post, start a followup discussion. Mark it resolved when the issue has been addressed, and add any relevant information back into the Q&A above.\n\nGo anonymous.\n\nShy? No problem. You can always opt to post or edit anonymously.\n\nTag your posts.\n\nIt's far more convenient to find all posts about your Homework 3 or Midterm 1 when the posts are tagged. Type a “#” before a key word to tag. Click a blue tag in a post or the question feed to filter for all posts that share that tag.\n\nFormat code and equations.\n\nAdding a code snippet? Click the pre or tt button in the question editor to add pre-formatted or inline teletype text.\nMathematical equation? Click the Fx button to access the LaTeX editor to build a nicely formatted equation.\n\nView and download class details and resources.\n\nClick the Course Page button in your top bar to access the class syllabus, staff contact information, office hours details, and course resources—all in one place!\n\n\nContact the Piazza Team anytime with questions or comments at team@piazza.com. We love feedback!",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}