{
    "author": "Anonymous Mouse",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 506,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/506",
    "title": "Course conflict",
    "question": "Hello, I am experiencing this problem and I was just wondering what I could do to fix this.\n\n\nI am registered in CPSC 110 on Tuesdays and Thursdays, starting at 12:30. I am also registered in chemistry 245 lab is right before the CPSC 110 class, from 9:30 AM to 12:30 PM.  This lab usually ends either exactly on time or a few minutes late (many students in the lab left later than 12:30 on Thursday, it was not just me).  \nAs a result, it was impossible for me to arrive at the CPSC 110 lecture in time to participate in the clicker questions.  I like CPSC very much, and am caught up with the material (95% on my mid-term), but I don't want to lose marks from missing out on the clicker questions. This was not an issue when classes were online and there was no lab, but it is now becoming a serious problem now that classes are back in person.\nIs it possible for the clicker questions a few minutes later in the class, or maybe near the end of the class, so that I have a chance to participate? If not,  any suggestions for this problem would be greatly appreciated!\nThank you",
    "student_answer": "Classes are supposed to end 10 minutes before the \"end time\" on SSC. You would need to contact your chemistry lab TA or chemistry lab coordinator to find a solution.",
    "instructor_answer": "Unfortunately the problem here is your chemistry lab.  Any class, or lab, or academic activity scheduled to end on the hour (10, 11, 12...) is actually supposed to end 10 minutes before the hour (9:50, 10:50, 11:50...).  Any class, or lab, or academic activity scheduled to end on the half hour (9:30, 12:30...) is actually supposed to end at 20 after (9:20, 12:20...)  Instructors are supposed to make sure that everyone can leave at xx:50 or xx:20.  Everything about class and space scheduling at UBC depends on all instructors and students following these rules.  The instructor coming into the room needs time to get setup, and students need time to get from one class to the next."
}