{
    "author": "Anonymous Beaker",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 973,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/973",
    "title": "practice final 2019W1 Question #7",
    "question": "Hi,\n\nI'm working on a practice final and have some questions about Q7:\n\n1) I'm trying to create a template with the given data definitions but not sure if I'm heading in the right direction. Here's what I got so far:\n\nGiven a (listof class) and a (listof slot), and the given check-expects, it seems that we are assigning the first class to the first slot that has enough space, (adding to the visited), then we move onto the next class until all classes are assigned. With previous questions in the course, we are usually given an X and then a (listof Y). In this case, we're given a (listof X) and (listof Y). Does that mean we have to the fn-for-los (slot) in the fn-for-loc (class). If that is the case, we would have 2 pairs of (first lox) and (rest lox) in the single fn: fn-for-loc. I could be totally wrong.\n\n2) we are also given a helper called wasted-space which calculates the difference between the assigned slot-size and class-size, which we must use in the question. However, from the check-expect provided, it seems that the classes are assigned to the first slot that has enough space so I don't really understand where this helper would need to be placed. One thought that I had may follow the same idea as the sudoku problem, where we take the first class and make an assignment with every slot available. Then we prune first with the size requirement and then with the most efficient use of space using the helper wasted-space.\n\nHowever, this would contradict how I started in 1) where I'm searching through the lists. using the same idea as the sudoku problem, we would have a genrec where we're making all possible outcomes and pruning.\n\nPlease provide some thoughts (@ _ @)",
    "student_answer": "Just a heads up, I am 95% sure that your question tile is wrong, because I recently checked and the final 2019W2 does not exist yet or is unable to us on the index exam page... I think you meant FINAL 2019W1 Question 7. It might help to change the tile for clarification to others so they do not give you the incorrect explanation as those are different finals... ",
    "instructor_answer": "Not Found"
}