{
    "author": "Emily Fuchs (she/they)",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 6,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/6",
    "title": "How to Use Piazza Well",
    "question": "The Piazza discussion forum is a great resource for you to get answers to questions you have about the 110 material, course structure, policies etc. The TAs and instructors look forward to being able to help you by answering questions on Piazza.\nPiazza also provides an opportunity for those of you who want to improve your learning by answering other students questions. Seeing how well people ask and answer questions on Piazza helps us choose TAs for next term.\nBut for Piazza to really work well for 600+ people we all need to pay attention to how to use it well. The biggest part of that is knowing how to ask good questions on Piazza. And the biggest part of asking good questions is not asking bad ones. Seriously.\nPlease remember that 600+ people read Piazza, and take care not to ask questions that you could find the answer to with a couple minutes more looking. If the answer is in the Syllabus, the Schedule, or a problem set starter then you should find the answer there. A question about a DrRacket function like overlay you can look up in the DrRacket help desk.\nThat still leaves very very many good questions. Sometimes those will be asking for further clarification on something you have looked up. Often those questions will be about some part of a program that you have been working on. Again the rule to follow is to keep in mind that 800+ other people are reading Piazza. If you can take 5 more minutes to make the question easier for everyone else to understand then please do so. That's just good Karma. To do that please follow these guidelines:\nDo not post screenshots of text; post the actual text you are asking about. This includes program text and auto-grader feedback. Do not post an image of it, do not post a link to it, do not post the section number it came from. Post the actual text together with any other information the person answering the question might need. By posting the actual program text you make it easy for someone who wants to answer your question to quickly copy it, paste it into DrRacket, and work on it. By posting the extra information you save the person answering from having to go find what you already have right in front of you.\nFormat the code properly. In the Piazza editor there is a button labeled \"code.\" If you press that button and then paste your code into there it should be formatted properly. You may need to clean up the indentation though, and if so then please take the time to do it.\nFinally, if you are confused about something and asking for help then please take the time to say what you have done so far and what your current understanding is. Often times you will find that the act of writing that out will clarify things for you, and then you have your answer right away without having to wait. That also provides a good foundation for figuring things out in exams when there is no help. But even if explaining your current understanding doesn't clear things up right away, it will provide a better foundation for us to answer your question, and a better foundation for you to incorporate the answer.\nAgain, we encourage you to use Piazza as your go to resource for getting answers to your questions. Just take a few extra moments each time to invest in good karma by asking your question in a way that helps the people who try to read and answer it.\n#pin",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}