{
    "author": "Emily Fuchs (she/they)",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 1079,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/1079",
    "title": "Check Your Grades!",
    "question": "This post is a reminder to check your grades in Canvas to make sure everything is accurate. Please check your grades as soon as possible to help us make sure everything is taken care of before the end of the term. \n  If you notice any issues with your grades, you must email cpsc110-admin@cs.ubc.ca before 9:00 AM PDT on Monday, May 2. We will not accept any grade change requests once this deadline passes. Please include your name, student number, CSID (e.g. a1b2c), and a description of the issue in the email. If there are multiple issues, please include them all in one email. \n  Here are some important things to keep in mind:\nLab and problem set autograding reports received before assignment grades were released are provisional, meaning that your autograder score may go up or down once grades were released on Canvas. There is a note about this in the autograder email.\nAny calculation of final grades in Canvas is not accurate, including lab and problem set averages. We do our final calculation (including dropping your lowest lab and problem set grades) outside of Canvas. Please only refer to individual grades for each item in Canvas. \nA -1 means that you are excused from that particular item. It will not count towards your final grade, and in the case of labs and problem sets, it will not count as the lowest grade that we drop.\nYour grade for each lab is calculated using your autograder score and the score that your TA gives you out of three for attendance, behaviour, and check-off. The grading scheme is as follows:\nIf you get 3/3 for your TA score, your lab grade will be your autograder score\nIf you get 2/3 for your TA score, your lab grade will be capped at 80%\nIf you get 1/3 for your TA score, your lab grade will be capped at 60%\nIf you get 0/3 for your TA score, your lab grade will be 0\nYour grade for each problem set is calculated using your autograder score and your TA assessment score. Over the course of the term, your TA assessment score will contribute to 1/3 of your overall problem set grade. The grading scheme is as follows:\nIf you have the short TA assessment, your problem set grade is 75% autograder score and 25% TA assessment score\nIf you have the long TA assessment, your problem set grade is 50% autograder score and 50% TA assessment score\nWe have calculated and posted your final Lecture grade on Canvas as of today (Monday, April 25). This grade takes into account any exemptions and 1 week of everyone's lowest lecture scores were automatically dropped.\nVantage tutorial grades will be uploaded to Canvas soon.\nYour final exam grade will not be available in Canvas or Gradescope and we will not share a copy of your marked exam. You will not know your course grade until the exam period is over and final grades are released through the SSC (this can take up to 7 business days after the date of the exam).\n  Please do not be alarmed if we do not respond right away, we will make sure to address any issues with grading before we release final grades. Thank you for your patience and take care. \n ",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}