{
    "author": "Anonymous Atom",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 927,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/927",
    "title": "the fact of midterm2",
    "question": "I would like to complain about the fact that midterm2 is very unreasonable both in terms of grading and question content\nquestion 2 and question 3 are too long and very difficult to understand, I spent a lot of time studying these 2 questions throughout the exam, but still don't understand the question 2 and question 3 led me to get 0 points for these 2 questions.\nI discuss this issue with a professor, and the suggestion was that I might need to improve my English level, but my English classes are all above A level,  I definitely believe that my English level is enough to study introductory computer courses, and I have discussed this issue with many students around me, and almost all of them do not understand the meaning of the question. And Question 2 and Question 3 seriously affected me to do the next questions, although I got all the points in Question 1 and Question 5.  I fail mt2.\nI don't think the test results give reasonable feedback on my understanding of the course. And I think the design of the exam is not reasonable and fair enough compare with the leaked exam, considering the short time of the designed questions. \nI hope the professor will consider this and give a new midterm and final grading mechanism for those who are frustrated in mt2",
    "student_answer": "I agree, I think that if the suggestion is to improve English level rather than study more on some specific concepts then there might be some underlying issue in the exam.",
    "instructor_answer": "When we returned the midterm March 17th we talked about how problems 2 and 3 were probably harder than we intended. We also talked about the fact that the overall grade for the exam was within the historical bounds.  On the low side, but not extremely low.  It was also the case that significant partial credit was available for problems 2 and 3 as long as the file passed check syntax.  21% partial credit was awarded if the signature was correct and the supplied templates were intact.\nAt this point there is simply no way to consider having another midterm exam. The term ends tomorrow.  \nI don't believe I met with you, so I can't be sure what the instructor who met with you said. But I don't believe their primary response would have been to tell you to improve your english level. I know my primary response would be to walk through your exam with you, and talk about how to do better with problems that may be complicated to understand. How to use the recipe to work your way from confusion to understanding.\nI think that if you heard the focus on the meeting being on your English skills then I would encourage you to go back and speak with them again, or come to see one of the other two instructors -- not as a way to go around that first instructor, but instead to get additional perspective on how to do best on future exams.  All of us want to help all of you do your very best possible work."
}