{
    "author": "Kemi Ola",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 629,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/629",
    "title": "Some advice as the course gets more difficult",
    "question": "This note gathers together some different bits of advice we've given different suggestions about the period of the course we are entering.\nAs many of you have realized (and as noted prior to the break), the material in CPSC 110 got harder just recently.  And while the reading week break was wonderful, it may have caused you to get a little out of practice with the 110 material.  With that in mind, here's a reminder about some of the resources available to you that can help you work through this more challenging material:\n\nThe problem bank:  problems entitled Abstraction L1-L3 and Abstraction P1-P10 provide additional practice on the concepts that we covered in class last week. Note that solutions are provided to every practice problem.  However, please don't be tempted to just read through the solution - keep in mind that you get good at software design by doing it yourself - not by reviewing an answer produced by someone else.  \n\nThe edX videos: if there's something you didn't understand, take time to review the corresponding video again and then work through some additional practice problems.\nThe recorded last term lectures @484.\nOffice hours.  The course offers lots of office hours @9  and will offer even more this week @613. \nAnd of course Piazza is a good way to get fast accurate answers to course questions.  We don't always answer with a mini lecture - instead we often answer by asking you a question back.  You may find this initially frustrating, but we are trying to help you be able to solve the problems yourselves, rather than just solve the problems.  That's what you will want to be able to do for the exams -- solve them yourself. \nWhile we would never offer specific guidance on what will or will not be covered on an exam, we're not giving much away by saying that module 08 will naturally form a significant part of our upcoming midterm.  So now is the time to dig in - you can do this!  ",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}