{
    "author": "Emily Fuchs (she/they)",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 397,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/397",
    "title": "Course Delivery Update",
    "question": "As announced in President Ono's UBC Broadcast last week, UBC is returning to in-person instruction for the majority of courses starting Monday, February 7. This announcement outlines what this means for CPSC 110, please read it carefully. \nMostly importantly, stay home if you are feeling unwell. It does not matter what you think you may be sick with (e.g., COVID, cold, flu, etc.), stay home so you can rest and recover, and to avoid putting others at risk. Please refer to the Missing Assignments section of the course syllabus for instructions on what to do if you have to miss class for any reason, and the COVID-19 Info page for general safety guidance. \nIf you have a health concern that prevents you from attending in-person course activities for the remainder of the term, please contact cpsc110-admin@cs.ubc.ca with your medical documentation ASAP. \nLecture\nLectures will return to in-person delivery, please check the SSC to see where your lecture section meets. We will provide recordings of last term's in-person lecture streams for the purposes of review and to encourage students to stay home if they are feeling unwell. More details to come about how to access these recordings. As specified in the course syllabus, we automatically drop one week of your lowest lecture scores to allow for the occasional missed lecture. \nLabs\nLabs will return to in-person delivery, please check the SSC to see where your lab section meets. \nOffice Hours\nOffice hours will continue to take place online for the remainder of the term. Some TAs may choose to hold in-person office hours, and will list the location of their office hours in @9. \nExams\nMidterm 1 is still scheduled to take place online. Midterm 2 and the Final Exam are scheduled to take place in-person, however, we will keep you updated about any changes as we receive further information and guidance from UBC and local health authorities. We will provide further instructions for in-person exams closer to the date of Midterm 2 and and the Final Exam. ",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}