{
    "author": "William Xiao",
    "position": "student",
    "course": "CPSC 110 2021WT2",
    "post_num": 907,
    "link": "https://piazza.com/class/ky0ewiregcz421/post/907",
    "title": "maze worklist animation",
    "question": "A number of you are working hard on the maze-4-way-solveable-starter (and now the separate maze-4-way-solveable-tr-starter).\nWe have developed a tool that you MAY find helpful.  It visualizes the accumulators at each step going through the maze.  But, please note:\nit is brand new and experimental!\nif you see it show values that don't make sense, stop looking at it and post a question/bug report!!\nstart with very simple examples like M4\nit alternates between showing\nthe values of the arguments to solve/p, at each call to solve/p\nand the values of the arguments to solve/lop at each call to solve/lop\nOne consequence of the above is that it only shows p and path when it is at solve/p, since p and path are not arguments to solve/lop\npressing <space> goes to the next call\npressing r restarts\nIt is a world program, so like other world programs first press the run button, and then go into the Interactions Pane and type something like (main M4).  When you do that you will see:\n- The maze itself\n- The p argument to fn-for-pos will be shown as:\n   - a black circle if it will be fine to proceed\n   - a red X if there will be a conflict because p is in path\n   - a grey X if there will be a conflict because p is in visited\n- The worklist is shown in green, 0 is the first position in the worlist, 1 is the second and so on\n- Every position on the current path has a red P\n- Every position on visited has a grey V\nHave fun.  We hope this helps. But it is experimental. If you don't like it or if it is confusing then please stop using it right away!  We will improve it based on your feedback.\nNOTE: You will probably find the number of worklist entries surprising.  It totally makes sense once you step a number of examples and think about it, but I will confess to being initialize surprised.  \nALSO NOTE: The code follows the core recipes, but in the interest of getting it out there quickly is missing many recipe elements.\nALSO ALSO NOTE: All the instructors contributed to this, but I was the very last person to touch the code, so while the main ideas are shared, any remaining bugs are my fault.\nm11-maze-4-way-animator.rkt",
    "student_answer": "Not Found",
    "instructor_answer": "Not Found"
}